app/views/bookings/new.html.erb

SELECT `properties`.`name`, `properties`.`id` FROM `properties`
---
		<%= f.label :property %> </br>
		<%= f.select :property_id,Property.all.pluck(:name,:id) %>