app/controllers/application_controller.rb

 def after_sign_in_path_for(resource)
 	# binding.pry
 	u=current_user
 	# binding.pry
	# current_user.roles.destroy_all
	# binding.pry
	role = Role.find_by(field: params[:user][:roles])
	# binding.pry
	current_user.roles << role if role !=nil
	if current_user.roles.first.field == 'customer'
		return bookings_path
	elsif current_user.roles.first.field== 'property owner'
---
SELECT `roles`.* FROM `roles` WHERE `roles`.`field` = 'customer' LIMIT 1
SELECT `roles`.* FROM `roles` INNER JOIN `roles_users` ON `roles`.`id` = `roles_users`.`role_id` WHERE `roles_users`.`user_id` = 10 ORDER BY `roles`.`id` ASC LIMIT 1
SELECT `roles`.* FROM `roles` INNER JOIN `roles_users` ON `roles`.`id` = `roles_users`.`role_id` WHERE `roles_users`.`user_id` = 12 ORDER BY `roles`.`id` ASC LIMIT 1