app/controllers/bookings_controller.rb

INSERT INTO `bookings` (`startDate`, `endDate`, `status`, `price`, `user_id`, `created_at`, `updated_at`, `property_id`) VALUES ('2022-01-01', '2022-01-03', 'active', 300, 10, '2022-08-25 05:30:36.365348', '2022-08-25 05:30:36.365348', 4)
---
	def create
		# @booking=Booking.new(booking_params)
		@booking=current_user.bookings.build(booking_params)
		# @booking.user =current_user
		# @booking.property_id = 4
		if @booking.save

DELETE FROM `bookings` WHERE `bookings`.`id` = 2
---
	def destroy
		@booking.destroy

UPDATE `bookings` SET `bookings`.`price` = 1234, `bookings`.`updated_at` = '2022-08-24 20:33:22.382202' WHERE `bookings`.`id` = 4
---
	def update
		if @booking.update(booking_params)

SELECT `bookings`.* FROM `bookings` WHERE `bookings`.`id` = 2 LIMIT 1
---
		def set_booking
			@booking =Booking.find(params[:id])