app/controllers/properties_controller.rb

INSERT INTO `properties` (`name`, `address`, `latitude`, `longitude`, `user_id`, `created_at`, `updated_at`) VALUES ('advant', 'sector 56', '67.98', '21.34', 12, '2022-08-24 20:59:36.335248', '2022-08-24 20:59:36.335248')
---
	def create
		@property=Property.new(property_params)
		@property.user =current_user
		if @property.save

UPDATE `properties` SET `properties`.`latitude` = '67.99', `properties`.`updated_at` = '2022-08-24 21:01:19.686757' WHERE `properties`.`id` = 3
---
	def update
		if @property.update(property_params)

SELECT `properties`.* FROM `properties` WHERE `properties`.`id` = 5 LIMIT 1
---
		def set_property
			@property =Property.find(params[:id])