app/views/layouts/application.html.erb

      <li><% if user_signed_in? %>
        <% if current_user.roles.first.field == 'customer' %>
---
SELECT `roles`.* FROM `roles` INNER JOIN `roles_users` ON `roles`.`id` = `roles_users`.`role_id` WHERE `roles_users`.`user_id` = 10 ORDER BY `roles`.`id` ASC LIMIT 1